__desktopReleasesCallback([{"name":"","notes":["[Fixed] Update Git LFS to 3.7.1 to address CVE-2025-26625","[Fixed] Check run status icons in the re-run checks dialog have a status tooltip that is accessible by screenreaders - #21191","[Fixed] The Whitespace hint popover appears when right-clicking diff lines while \"Hide whitespace changes\" is enabled - #20848. Thanks @zekariasasaminew!","[Fixed] The cancel button in the sign-in dialog is enabled after sign-in attempt - #21144. Thanks @zekariasasaminew!","[Fixed] The \"Update Email\" button in the \"Misattributed Commit\" popover works after login from a different account - #21176","[Fixed] Improve host discovery when using authenticating proxies - #19039 #19120","[Fixed] Fix diff search results highlights not visible on addition hunks - #21134","[Fixed] Add Copilot commit message generation to context menu - #21000. Thanks @zekariasasaminew!","[Fixed] Override system accent color for checkboxes and radio buttons - #21088","[Improved] The icon contrast on the pull request check run button meets minimum 3:1 contrast requirements - #21189","[Improved] Increased title bar height on macOS Tahoe - #21135. Thanks @berkcebi!","[Improved] Display line change count in PR Preview Dialog - #21126. Thanks @iammola!","[Improved] Allow users to skip commit message override confirmation - #21025. Thanks @ilyassesalama!","[Improved] Allow generating commits with Copilot in non-GitHub repositories - #20698. Thanks @schroedermarius!"],"pub_date":"2025-11-05T14:12:24Z","version":"3.5.4"},{"name":"","notes":["[Added] Add Ptyxis shell integration - #20963. Thanks @logonoff!","[Fixed] Copilot message generation in progress message is announced to screen readers - #21008","[Fixed] Fix: Improve spacing between graphic and text - #7500. Thanks @robbierotman!","[Fixed] Focus lands on first interactive control instead of 'Continue' button in the conflict resolution dialog - #20880","[Improved] Upgrade Electron to v38.2.0 - #21060","[Improved] The text color of the 'File does not exist' merge conflict warning meets 4.5:1 contrast requirements - #20902","[Improved] Provides the tooltips for list items in a single condensed tooltip that allows keyboard users and screen reader users access upon navigation of a list item - #20804","[Removed] Remove support for macOS 11 - #21060"],"pub_date":"2025-10-08T09:20:27Z","version":"3.5.3"},{"name":"","notes":["[Fixed] Fix the crash that sometimes occurs when opening Pull Request-related notifications - #20761","[Fixed] Ensure the cursor type on links is pointer - #20766. Thanks @huanfe1!","[Fixed] Fix CmdOrCtrl+Enter in squash dialog - #20716","[Fixed] Keyboard selection in the repository list now persists when the list of repositories update  - #20672","[Fixed] Organization is no longer prefixed to repositories with aliases in the recent group - #20651","[Improved] Tutorial responsively adapts at high zoom levels - #20691","[Improved] Add the ability to filter changed files by status (modified, new, deleted, untracked) as well as by file exclusion from commit  - #20537. Thanks @Gr8z!"],"pub_date":"2025-07-21T15:59:17Z","version":"3.5.2"},{"name":"","notes":["[Fixed] Use all changes to generate a commit message when amending commits - #20664","[Improved] Upgrade embedded Git to v2.47.3 on macOS, and to v2.47.3.windows.1 on Windows"],"pub_date":"2025-07-08T19:52:46Z","version":"3.5.1"},{"name":"","notes":["[New] Copilot now helps you craft AI-generated commit messages with just one click - #17439"],"pub_date":"2025-06-18T08:36:47Z","version":"3.5.0"},{"name":"","notes":["[Added] Handled GitHub Secret Scanning push protection errors in a friendly dialog with the ability to bypass blocked non-approval requiring secrets - #20386, #20387, #20391","[Fixed] Fix spacing of text in \"Thank You\" banner - #20411","[Fixed] Radio inputs include the area around the radio button as a click surface - #20404","[Fixed] Checking or unchecking lots of files is fast once again - #20429","[Fixed] Fix path used to create repository on existing non-Git directory - #20400","[Fixed] Show default branch name when opening Git settings from 'committing as' popup - #20399","[Improved] Upgrade Electron to v36.1.0 - #20450","[Improved] Users can turn off the filter in the changes list in the `View` menu - #20303"],"pub_date":"2025-06-11T10:20:20Z","version":"3.4.21"},{"name":"","notes":["[Fixed] Prevent network share traversal with renamed UNC paths on Windows"],"pub_date":"2025-05-21T13:47:42Z","version":"3.4.20"},{"name":"","notes":["[New] Users can filter the changed files list - #20220","[New] Add support for multiple enterprise accounts - #20227","[Fixed] Right-clicking on selected files will keep those files selected in the changes list - #20319","[Fixed] Let credential helper prompt for the specific enterprise account used in a given repository - #20318","[Fixed] Fix invalidated token dialog styling - #20317","[Fixed] Fix indentation bug in split diff view - #18800. Thanks @iamarjunsuresh!","[Fixed] Initialize Integrations settings when opening it from a no-changes screen - #19807. Thanks @iamarjunsuresh!","[Fixed] Resizing the list of files in \"Preview Pull Request\" does not open/create the pull request - #20200","[Fixed] Section lists such as the repository list in the cloning dialog and the pull request list announce their labels to screen readers - #20184","[Fixed] The added and removed prefixes of diff do not wrap making diff contents width equal in side by side diffs - #20191","[Fixed] Pressing Ctrl+A in the Find dialog selects the search text instead of the diff content - #20049","[Improved] Improve default README formatting - #20161. Thanks @OctCarp!","[Improved] The radio options label in the \"How do you plan to use this fork?\" dialog reflects their purpose - #20183","[Improved] The radio controls in the create branch, stashing changes, and fork behavior dialogs have visual selection indicators - #20052","[Improved] Promote use of GIT_CONFIG_PARAMETERS to production - #20198","[Improved] Use the default cursor instead of the text cursor in the whitespace hint popover - #20153"],"pub_date":"2025-04-23T07:47:59Z","version":"3.4.19"},{"name":"","notes":["[Fixed] Prevent crash due to non-critical error - #20150","[Fixed] Reinstate missing space in the About dialog last checked text - #20094. Thanks @alexravenna!"],"pub_date":"2025-03-10T15:16:46Z","version":"3.4.18"},{"name":"","notes":["[Fixed] Dialogs announce their titles on macOS Sequoia for VoiceOver users - #20009","[Fixed] The commit button words are separated by spaces for screen reader users - #20011","[Fixed] Prevent crash when attempting to launch external editor with insufficient permissions - #19929","[Fixed] Running the Desktop CLI on Windows no longer waits for Desktop to exit before exiting itself - #19916","[Improved] Announce update progress in about dialog - #20018","[Improved] Buttons with dropdown caret that trigger context menus can be opened with down arrow - #20007","[Improved] Links that do not open external urls now have a role of button for improved screen reader semantics - #20010","[Improved] Email attribution warning only considers verified emails - #19968","[Improved] Improve tooltip for unknown co-authors - #19992","[Improved] The length of shortened SHAs are consistently 7 characters - #19902. Thanks @molnarriso!","[Improved] Upgrade Electron to v34.0.1 - #19919","[Removed] Remove support for macOS 10.15 - #19919"],"pub_date":"2025-02-26T18:39:58Z","version":"3.4.17"}]);